export default {
  info: {
    name: 'العربية',
    flag: 'sa',
    languages: {
      tr: 'التركية',
      en: 'الإنجليزية',
      de: 'الألمانية',
      fr: 'الفرنسية',
      ru: 'الروسية',
      dk: 'الدنماركية',
      pt: 'البرتغالية',
      gr: 'اليونانية',
      ar: 'العربية'
    }
  },
  search: {
    title: 'معرف المستخدم / أي معرف',
    input: {
      required: 'هذا الحقل مطلوب.',
      minLength: 'يجب أن يكون على الأقل {0} حرفًا.',
      maxLength: 'يجب ان يكون أقصى شيء {0} حرفًا.',
      numeric: 'فقط الأرقام (معرف استخدام ديسكورد) مقبولين.'
    },
    button: 'بحث',
    quick: 'معرف المستخدم او أي معرف'
  },
  list: {
    recent: 'عمليات البحث الأخيرة',
    favorites: 'المفضلة',
    empty: 'هذه القائمة فارعة',
    approve: 'إزالة'
  },
  result: {
    title: {
      id: 'معرف المستخدم',
      type: 'نوع المستخدم',
      date: 'تاريخ الإنشاء',
      age: 'العمر'
    },
    type: {
      user: 'حساب عادي',
      bot: 'حساب بوت'
    },
    favorites: {
      add: 'إضافة للمفضلة',
      remove: 'إزالة المفضلة'
    }
  },
  selectLanguage: 'اللغة',
  discord: 'لا ينتمي إلى شركة الديسكورد الرسمية.'
}
